
//hw1
//Jingjing Chen jingjin1@andrew.cmu.edu
//copyright 2013

size(450,440);
background(#000000);
stroke(#81FFFC,150);
strokeWeight(1.5);

fill(#FFB700);//橙
rect(0,230,30,30);
rect(0,260,30,30);
rect(0,290,30,30);
rect(0,320,30,30);
fill(#FF0000);//红
rect(0,350,30,30);
rect(0,380,30,30);
fill(#8540FF);//雪青


fill(#00B90A);//绿
rect(30,230,30,30);
rect(30,260,30,30);
rect(30,290,30,30);
fill(#FF0000);
rect(30,320,30,30);
rect(30,350,30,30);
fill(#00B90A);
rect(30,380,30,30);
fill(#00B90A);
rect(30,410,30,30);

fill(#FF0000);//红
rect(60,200,30,30);
fill(#00B90A);//绿
rect(60,230,30,30);
rect(60,410,30,30);

fill(#FF0000);//红
rect(90,200,30,30);
fill(#FF0000);//红
rect(90,230,30,30);
fill(#00B90A);//绿
rect(90,410,30,30);

fill(#FF0000);//红
rect(120,230,30,30);
fill(#FF0000);//红
rect(120,320,30,30);
fill(#FF0000);//红
rect(120,410,30,30);


fill(#FFB700);//橙
rect(150,260,30,30);
rect(150,290,30,30);
fill(#FF0000);//红
rect(150,320,30,30);
rect(150,350,30,30);
fill(#FF0000);//红
rect(150,380,30,30);
fill(#FF0000);//红
rect(150,410,30,30);


fill(#FFB700);//橙
rect(180,260,30,30);
rect(180,290,30,30);
fill(#FF0000);//红
rect(180,350,30,30);
fill(#FF0000);//红
rect(180,380,30,30);


fill(#FFB700);//橙
rect(210,260,30,30);
rect(210,290,30,30);


fill(#FFB700);//橙
rect(240,260,30,30);
rect(240,290,30,30);
fill(#FF0000);//红
rect(240,350,30,30);
fill(#2EB8FF);//蓝
rect(240,380,30,30);
rect(240,410,30,30);


fill(#00B90A);//绿
rect(270,230,30,30);
rect(270,260,30,30);
rect(270,290,30,30);
fill(#FF0000);//红
rect(270,320,30,30);
rect(270,350,30,30);
fill(#2EB8FF);//蓝
rect(270,380,30,30);
rect(270,410,30,30);

fill(#00B90A);//绿
rect(300,185,30,30);
rect(300,215,30,30);
rect(300,290,30,30);
fill(#FF0000);//红
rect(300,320,30,30);
fill(#00B90A);//绿
rect(300,380,30,30);
rect(300,410,30,30);

fill(#00B90A);//绿
rect(330,215,30,30);
rect(330,380,30,30);
fill(#FFB700);//橙
rect(330,410,30,30);

fill(#00B90A);//绿
rect(360,215,30,30);
fill(#8540FF);//雪青
rect(360,290,30,30);
fill(#00B90A);//绿
rect(360,320,30,30);
fill(#FF0000);//红
rect(360,350,30,30);
fill(#00B90A);//绿
rect(360,380,30,30);
fill(#FFB700);//橙
rect(360,410,30,30);

fill(#8540FF);//雪青
rect(390,260,30,30);
rect(390,290,30,30);
fill(#00B90A);//绿
rect(390,320,30,30);
fill(#FF0000);//红
rect(390,350,30,30);
rect(390,380,30,30);
fill(#FFB700);//橙
rect(390,410,30,30);

fill(#FFB700);//橙
rect(420,170,30,30);
rect(420,200,30,30);
rect(420,230,30,30);
rect(420,260,30,30);
fill(#8540FF);//雪青
rect(420,290,30,30);
fill(#00B90A);//绿
rect(420,320,30,30);
rect(420,350,30,30);
fill(#FF0000);//红
rect(420,380,30,30);
fill(#FFB700);//橙
rect(420,410,30,30);






