
size(600,300);
 colorMode(RGB);
 background(255);
 
 int diameter,i;


//left//--------------------------------------------------------

  //左側の黒背景//-------------------------------
  fill(0);
  rect(0,0,300,300);

  //白のグラデーションをかけた円//-----------------
  noStroke();
  fill(255,20);
   diameter = 300;
   for(i=0; i<16; i++){
     ellipse(150,150,diameter,diameter);
     diameter = diameter - 10;
   } 

  //蛍光灯左右の灰色の四角形//--------------------
  noStroke();
  fill(143,143,143);
  rect(20,140,6,20);

  noStroke();
  fill(143,143,143);
  rect(275,140,6,20);
 
  //蛍光灯下地の灰色の四角形//--------------------
  fill(95);
  rect(25,140,250,20);

  //蛍光灯両端の白いグラデーション//---------------
  for(int x=0; x<100; x+=2) {
   noStroke();
   fill(255,255,255,1+x); 
   rect(125-x,140,20,20);
  }

  for(int x=0; x<100; x+=2) {
   noStroke();
   fill(255,255,255,1+x); 
   rect(x+155,140,20,20);
  }
 
  //蛍光灯に乗せる白い四角形//--------------------
  fill(255);
  rect(45,140,210,20);
  noStroke();
 
 
 

//right//-------------------------------------------------------

  //右側の黒背景//-------------------------------
  fill(0);
  rect(300,0,300,300);
 
  //白の二つグラデーションをかけた円//--------------
  noStroke();
  fill(255,100);
   diameter = 300;
    for(i=0; i<16; i++){
       if(i>6&&i<9){
       fill(0);
       }
       else{
       fill(255,30);
       }
  
    ellipse(450,150,diameter,diameter);
     diameter = diameter - 10;
   } 
 
  //蛍光灯左右の灰色の四角形//--------------------
  noStroke();
  fill(143,143,143);
  rect(320,140,6,20);

  noStroke();
  fill(143,143,143);
  rect(575,140,6,20);
 
  //蛍光灯下地の灰色の四角形//--------------------
  fill(95);
  rect(325,140,250,20);
  
  //蛍光灯両端の白いグラデーション//---------------
   for(int x=0; x<100; x+=2) {
    noStroke();
    fill(255,255,255,1+x); 
    rect(425-x,140,20,20);
   }

   for(int x=0; x<100; x+=2) {
    noStroke();
    fill(255,255,255,1+x); 
    rect(x+455,140,20,20);
   }
 


//中心線//----------------------------------------------------
stroke(90);
line(300,0,300,300);



//コメント//
//蛍光灯をモチーフにし、普通に光っている状態(左)と切れかけの状態(右)で安定と変動を表現しました。//





