
int h, diameter, eSize = 6;

size(600, 300);
colorMode(RGB, 600);
background(200);
noStroke();
smooth();


//左側左上の円---------------------------------------
fill(52, 121, 255, 240);
ellipse(60, 60, 70, 70);


//背景---------------------------------------------
for (int j = 0; j <= 600; j += 20) {
  for (int i = 0; i <= 600; i += 15) {
    fill(0, i, i, 255);
    ellipse(i, j, eSize, eSize);
  }
}

//背景の円------------------------------------------
ellipse(600, 150, 600, 600);


//右側中心より上線---------------------------------------
stroke(134, 189, 255, 230);
strokeWeight(5);
line(300, 140, 600, 140);


//右側中心より上2番目線---------------------------------
stroke(183, 216, 255, 230);
strokeWeight(5);
line(300, 130, 600, 130);


//左側中心より上2番目線---------------------------------
stroke(63, 222, 109, 230);
strokeWeight(5);
line(0, 130, 300, 130);


//右側中心より下線---------------------------------------
stroke(134, 189, 255, 230);
strokeWeight(5);
line(300, 160, 600, 160);


//左側中心より下2番目線---------------------------------
stroke(63, 222, 109, 230);
strokeWeight(5);
line(0, 170, 300, 170);


//右側中心より下2番目線---------------------------------
stroke(183, 216, 255, 230);
strokeWeight(5);
line(300, 170, 600, 170);


//左側左下斜線青-------------------------------------
stroke(23, 32, 255, 240);
strokeWeight(3);
line(0, 285, 15, 300);


//左側左下斜線-------------------------------------------
stroke(0, 220);
strokeWeight(3);
line(0, 270, 30, 300);


//左側左下斜線青2-------------------------------------
stroke(23, 32, 255, 220);
strokeWeight(3);
line(0, 255, 45, 300);


//左側左下斜線2-----------------------------------------
stroke(0, 180);
strokeWeight(2);
line(0, 240, 60, 300);


//左側左下斜線青3------------------------------------
stroke(23, 32, 255, 165);
strokeWeight(2);
line(0, 225, 75, 300);


//左側左下斜線3-----------------------------------------
stroke(0, 150);
strokeWeight(1);
line(0, 210, 90, 300);


//左側左下斜線青4------------------------------------
stroke(23, 32, 255, 135);
strokeWeight(1);
line(0, 195, 105, 300);


//左側左下斜線4-----------------------------------------
stroke(0, 120);
strokeWeight(1);
line(0, 180, 120, 300);


//右側左上斜線------------------------------------------
stroke(246, 255, 3, 230);
strokeWeight(5);
line(350, 0, 600, 270);


//右側上2番目斜線---------------------------------------
stroke(255, 243, 3, 230);
strokeWeight(4);
line(420, 0, 600, 240);


//右側上3番目斜線---------------------------------------
stroke(225, 255, 3, 230);
strokeWeight(3);
line(500, 0, 600, 210);


//右側上4番目斜線---------------------------------------
stroke(250, 255, 113, 230);
strokeWeight(2);
line(570, 0, 600, 180);


//右側左下斜線------------------------------------------
stroke(24, 185, 13, 230);
strokeWeight(5);
line(350, 300, 600, 30);


//右側下2番目斜線---------------------------------------
stroke(65, 232, 54, 230);
strokeWeight(4);
line(420, 300, 600, 60);


//右側下3番目斜線---------------------------------------
stroke(48, 250, 117, 230);
strokeWeight(3);
line(500, 300, 600, 90);


//右側下4番目斜線---------------------------------------
stroke(3, 255, 88, 230);
strokeWeight(2);
line(570, 300, 600, 120);


//右下青玉---------------------------------------------
diameter = 120;
for (int i=0; i<20; i++) {

  if (i==5||i==10) {
    fill(400);
  } else {
    fill(24, 51, 196, 100);
  }
  ellipse(515, 250, diameter, diameter);
  diameter = diameter - 10;
} 

//右赤玉---------------------------------------------
diameter = 100;
for (int i=0; i<20; i++) {

  if (i==5||i==6) {
    fill(400);
  } else {
    fill(255, 113, 113, 100);
  }
  ellipse(410, 120, diameter, diameter);
  diameter = diameter - 10;
} 

//右紫玉----------------------------------------------
diameter = 110;
for (int i=0; i<20; i++) {

  if (i==5||i==8) {
    fill(400);
  } else {
    fill(195, 113, 255, 100);
  }
  ellipse(430, 200, diameter, diameter);
  diameter = diameter - 10;
} 

//右上外側の玉---------------------------------------
diameter = 120;
for (int i=0; i<20; i++) {

  if (i==3||i==3) {
    fill(400);
  } else {
    fill(113, 255, 247, 30);
  }
  ellipse(600, 0, diameter, diameter);
  diameter = diameter + 10;
} 

//右上内側の玉---------------------------------------
diameter = 150;
for (int i=0; i<20; i++) {

  if (i==5||i==10) {
    fill(400);
  } else {
    fill(54, 72, 255, 120);
  }
  ellipse(600, 0, diameter, diameter);
  diameter = diameter - 10;
} 

//中心の点線----------------------------------------
for (int x = 0; x <= width; x += 10) {

  if (x < width/2) {
    fill(0, 255, 134);
  } else {
    fill(0, 116, 255);
  }

  ellipse(x, height/2, eSize, eSize);
  println("x=" + x);
  
}


