
int eSize=3;//円の直径

size(400,565);
background(255,255,200);//背景色
fill(255,30,40);//色
for(int x=0; x<=width; x++){

  stroke(0,255,127,127);
triangle(120,310,250,x+30,150,200);//三角形

 stroke(0,255,127,127);
triangle(120,30,300,x+100,150,200);

 stroke(x,255,127,127);
line(width,200,100,x);

   stroke(x,255,127,127);
line(100,x,140,height);

stroke(120,255,127,127);
line(120,x+20,10,height);


stroke(0,255,127,127);
triangle(x,x+20,x+50,x+10,10,20);
rect(80, 300, 55, 55);


line(220, 20, 85, 75);//線
line(300, 100, 20, 85);
line(120, 20, 320, 125);
line(400, 100, 20, 150);



}

fill(255,255,255);

quad(200, 200, 86, 20, 69, 63, 30, 76); 
ellipse(220, 20, 55, 55);//円
ellipse(290, 500, 55, 55);


