
////////////////////////////////////////////
//  random walker
////////////////////////////////////////////

Walker w;            //Ã£ï¿½ï¿½WalkerÃ¥ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½Â®Ã£ï¿½ï¿½Ã¥Â¤ï¿½Ã¦ï¿½Â°Ã£ï¿½ï¿½Ã¯Â¼ï¿½Ã£ï¿½ÂªÃ£ï¿½ï¿½Ã£ï¿½Â¸Ã£ï¿½Â§Ã£ï¿½Â¯Ã£ï¿½ï¿½Ã¯Â¼ï¿½ w Ã£ï¿½Â®Ã¥Â®Â£Ã¨Â¨ï¿½
/////
void setup(){        //Ã£ï¿½ï¿½Ã¥ï¿½ï¿½Ã¦Âºï¿½Ã¥ï¿½ï¿½Ã£ï¿½ï¿½
  size(1280,720);
  w = new Walker();  // Ã£ï¿½ÂªÃ£ï¿½ï¿½Ã£ï¿½Â¸Ã£ï¿½Â§Ã£ï¿½Â¯Ã£ï¿½ï¿½ w Ã£ï¿½Â®Ã§ï¿½ï¿½Ã¦ï¿½ï¿½
  background(255);
}
/////
void draw(){         //Ã£ï¿½ï¿½Ã£ï¿½Â¡Ã£ï¿½Â¤Ã£ï¿½Â³Ã©ï¿½Â¢Ã¦ï¿½Â°Ã£ï¿½ï¿½Ã¯Â¼ï¿½Ã§ï¿½Â¡Ã©ï¿½ï¿½Ã£ï¿½Â«Ã£ï¿½Â¼Ã£ï¿½ï¿½Ã¯Â¼ï¿½
  background(255);
  w.getmouse();
  w.step();          //Ã£ï¿½ÂªÃ£ï¿½ï¿½Ã£ï¿½Â¸Ã£ï¿½Â§Ã£ï¿½Â¯Ã£ï¿½ï¿½ w Ã£ï¿½Â«Ã¦Â­Â©Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
  w.display();       //Ã£ï¿½ÂªÃ£ï¿½ï¿½Ã£ï¿½Â¸Ã£ï¿½Â§Ã£ï¿½Â¯Ã£ï¿½ï¿½ w Ã£ï¿½Â«Ã¨ï¿½ÂªÃ¥ï¿½ï¿½Ã£ï¿½ï¿½Ã¨Â¡Â¨Ã§Â¤ÂºÃ£ï¿½ï¿½Ã£ï¿½Â¦Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
}
/////
///// Ã£ï¿½Â¯Ã£ï¿½Â©Ã£ï¿½Â¹Ã¥Â®ï¿½Ã§Â¾Â©
class Walker{ //Ã£ï¿½Â¯Ã£ï¿½Â©Ã£ï¿½Â¹Ã¥ï¿½ï¿½Ã£ï¿½Â®Ã¦ï¿½ï¿½Ã¥ï¿½ï¿½Ã£ï¿½Â¯Ã¥Â¤Â§Ã¦ï¿½ï¿½Ã¥Â­ï¿½Ã£ï¿½Â§
  int x;      //Ã§ï¿½Â¶Ã¦ï¿½ï¿½Ã¥Â¤ï¿½Ã¦ï¿½Â°
  int y;      //Ã§ï¿½Â¶Ã¦ï¿½ï¿½Ã¥Â¤ï¿½Ã¦ï¿½Â°
  int mx;     //Ã§ï¿½Â¹Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã¨Â¦ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½Â¦Ã£ï¿½Â¹Ã£ï¿½Â®Ã¤Â½ï¿½Ã§Â½Â®
  int my;     //Ã§ï¿½Â¹Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã¨Â¦ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½Â¦Ã£ï¿½Â¹Ã£ï¿½Â®Ã¤Â½ï¿½Ã§Â½Â®
  int dir;    //Ã£ï¿½ï¿½Ã£ï¿½Â¦Ã£ï¿½Â¹Ã£ï¿½Â®Ã¦ï¿½Â¹Ã¥ï¿½ï¿½Ã£ï¿½ï¿½0Ã¥ï¿½Â³, 1Ã¥Â·Â¦, 2Ã¤Â¸ï¿½, 3Ã¤Â¸ï¿½
  int spd = 40;    //Ã¥ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½Â¹Ã£ï¿½ï¿½Ã£ï¿½Â¼Ã£ï¿½ï¿½
  
  Walker(){   //Ã£ï¿½Â³Ã£ï¿½Â³Ã£ï¿½Â¹Ã£ï¿½ï¿½Ã£ï¿½Â©Ã£ï¿½Â¯Ã£ï¿½Â¿Ã¯Â¼ï¿½Ã¥ï¿½ï¿½Ã¦ï¿½ï¿½Ã¥ï¿½ï¿½Ã£ï¿½Â®Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½Â®Ã£ï¿½Â¡Ã£ï¿½Â½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã¯Â¼ï¿½new Ã£ï¿½Â§Ã¥ï¿½Â¼Ã£ï¿½Â³Ã¥ï¿½ÂºÃ£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã¯Â¼ï¿½
    x = width/2;  //Ã§Âªï¿½Ã£ï¿½Â®Ã¤Â¸Â­Ã¥Â¿ï¿½Ã£ï¿½Â«
    y = height/2; //Ã§Âªï¿½Ã£ï¿½Â®Ã¤Â¸Â­Ã¥Â¿ï¿½Ã£ï¿½Â«
  }
  
  void getmouse(){
    mx = mouseX - x;
    my = mouseY - y;
    if( mx >= 0 ){  //Ã£ï¿½ï¿½Ã£ï¿½Â¦Ã£ï¿½Â¹Ã£ï¿½Â¯Ã¥ï¿½Â³
      if( my >= mx ){  
        dir = 2;  //Ã¤Â¸ï¿½Ã£ï¿½Â¸
      }else if( -my >= mx ){
        dir = 3;  //Ã¤Â¸ï¿½Ã£ï¿½Â¸
      }else{
        dir = 0;  //Ã¥ï¿½Â³Ã£ï¿½Â¸
      }
    }else{          //Ã£ï¿½ï¿½Ã£ï¿½Â¦Ã£ï¿½Â¹Ã£ï¿½Â¯Ã¥Â·Â¦
      if( mx >= my ){
        dir = 3;  //Ã¤Â¸ï¿½Ã£ï¿½Â¸
      }else if( mx >= -my ){
        dir = 2;  //Ã¤Â¸ï¿½Ã£ï¿½Â¸
      }else{
        dir = 1;  //Ã¥Â·Â¦Ã£ï¿½Â¸
      }
    }
  }
  
  void display(){ //Ã¨Â¡Â¨Ã§Â¤ÂºÃ§ï¿½Â¨Ã£ï¿½Â¡Ã£ï¿½Â½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
    stroke(1);    //Ã©Â»ï¿½Ã¨ï¿½Â²Ã£ï¿½Â«
    //point(x, y);  //Ã¥ÂºÂ§Ã¦Â¨ï¿½(x, y)Ã£ï¿½Â«Ã§ï¿½Â¹Ã£ï¿½ï¿½Ã¦ï¿½ï¿½Ã§ï¿½Â»
    ellipse(x, y, 100, 100);
  }
  void step(){    //Ã£ï¿½ï¿½Ã¦Â­Â©Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½Â¡Ã£ï¿½Â½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
    int choice = int(random(5)); // 0,1,2,3,4 Ã£ï¿½Â®Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
    
    if(choice == 4){  
      choice = dir;  //Ã©ï¿½Â²Ã¨Â¡ï¿½Ã¦ï¿½Â¹Ã¥ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½Â¦Ã£ï¿½Â¹Ã¦ï¿½Â¹Ã¥ï¿½ï¿½Ã£ï¿½Â¸
    }
    
    if(choice == 0){
      x += spd;
    }else if(choice == 1){
      x -= spd;
    }else if(choice == 2){
      y += spd;
    }else{
      y -= spd;
    }
  }
}
///////////
