
////////////////////////////////////////////
//  random walker
////////////////////////////////////////////
///// Ã£ï¿½Â¯Ã£ï¿½Â©Ã£ï¿½Â¹Ã¥Â®ï¿½Ã§Â¾Â©
class Walker{ //Ã£ï¿½Â¯Ã£ï¿½Â©Ã£ï¿½Â¹Ã¥ï¿½ï¿½Ã£ï¿½Â®Ã¦ï¿½ï¿½Ã¥ï¿½ï¿½Ã£ï¿½Â¯Ã¥Â¤Â§Ã¦ï¿½ï¿½Ã¥Â­ï¿½Ã£ï¿½Â§
  int x;      //Ã§ï¿½Â¶Ã¦ï¿½ï¿½Ã¥Â¤ï¿½Ã¦ï¿½Â°
  int y;      //Ã§ï¿½Â¶Ã¦ï¿½ï¿½Ã¥Â¤ï¿½Ã¦ï¿½Â°
  Walker(){   //Ã£ï¿½Â³Ã£ï¿½Â³Ã£ï¿½Â¹Ã£ï¿½ï¿½Ã£ï¿½Â©Ã£ï¿½Â¯Ã£ï¿½Â¿Ã¯Â¼ï¿½Ã¥ï¿½ï¿½Ã¦ï¿½ï¿½Ã¥ï¿½ï¿½Ã£ï¿½Â®Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½Â®Ã£ï¿½Â¡Ã£ï¿½Â½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã¯Â¼ï¿½new Ã£ï¿½Â§Ã¥ï¿½Â¼Ã£ï¿½Â³Ã¥ï¿½ÂºÃ£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã¯Â¼ï¿½
    x = width/2;  //Ã§Âªï¿½Ã£ï¿½Â®Ã¤Â¸Â­Ã¥Â¿ï¿½Ã£ï¿½Â«
    y = height/2; //Ã§Âªï¿½Ã£ï¿½Â®Ã¤Â¸Â­Ã¥Â¿ï¿½Ã£ï¿½Â«

  }
  void display(){ //Ã¨Â¡Â¨Ã§Â¤ÂºÃ§ï¿½Â¨Ã£ï¿½Â¡Ã£ï¿½Â½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
    stroke(255,255,random(255));    //Ã©Â»ï¿½Ã¨ï¿½Â²Ã£ï¿½Â«
   // noStroke();
    fill(random(255),255,random(255));
   ellipse(x,y,5,5);
  }
  void mdisplay()
  {
    fill(255,255,random(255));
    stroke(255,150,150);    //Ã©Â»ï¿½Ã¨ï¿½Â²Ã£ï¿½Â«
     ellipse(mouseX, mouseY, 15,15);
     fill(random(255),255,255);
      stroke(255,0,255);
     ellipse(mouseX, mouseY, 10, 10);
     noFill();
      ellipse(mouseX, mouseY, 8, 8);

  }
  void step(){    //Ã£ï¿½ï¿½Ã¦Â­Â©Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½Â¡Ã£ï¿½Â½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
  if(mouseX-x > 0 && mouseY-y > 0)
  {
    int choice = int(random(6)); // 0,1,2,3 Ã£ï¿½Â®Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
    if(choice == 0 || choice == 4){
      x++;
    }else if(choice == 1 ){
      x--;
    }else if(choice == 2 || choice == 5){
      y++;
    }else{
      y--;
    }
  }
  else if(mouseX-x > 0 && mouseY-y < 0)
  {
   int choice = int(random(6)); // 0,1,2,3 Ã£ï¿½Â®Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
    if(choice == 0 || choice == 4){
      x++;
    }else if(choice == 1 ){
      x--;
    }else if(choice == 2){
      y++;
    }else{
      y--;
    }
  }
  else if(mouseX-x < 0 && mouseY-y > 0)
  {
   int choice = int(random(6)); // 0,1,2,3 Ã£ï¿½Â®Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
    if(choice == 0){
      x++;
    }else if(choice == 1  || choice == 4){
      x--;
    }else if(choice == 2  || choice == 5){
      y++;
    }else{
      y--;
    }
  }
   else if(mouseX-x < 0 && mouseY-y < 0)
  {
   int choice = int(random(6)); // 0,1,2,3 Ã£ï¿½Â®Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
    if(choice == 0 ){
      x++;
    }else if(choice == 1 || choice == 4){
      x--;
    }else if(choice == 2){
      y++;
    }else{
      y--;
    }
  }
  else 
  {
   int choice = int(random(4)); // 0,1,2,3 Ã£ï¿½Â®Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
    if(choice == 0 ){
      x++;
    }else if(choice == 1 ){
      x--;
    }else if(choice == 2){
      y++;
    }else{
      y--;
    }
  }
  }
}
/////
Walker w;            //Ã£ï¿½ï¿½WalkerÃ¥ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½Â®Ã£ï¿½ï¿½Ã¥Â¤ï¿½Ã¦ï¿½Â°Ã£ï¿½ï¿½Ã¯Â¼ï¿½Ã£ï¿½ÂªÃ£ï¿½ï¿½Ã£ï¿½Â¸Ã£ï¿½Â§Ã£ï¿½Â¯Ã£ï¿½ï¿½Ã¯Â¼ï¿½ w Ã£ï¿½Â®Ã¥Â®Â£Ã¨Â¨ï¿½
/////
void setup(){        //Ã£ï¿½ï¿½Ã¥ï¿½ï¿½Ã¦Âºï¿½Ã¥ï¿½ï¿½Ã£ï¿½ï¿½
  size(640,360);
  w = new Walker();  // Ã£ï¿½ÂªÃ£ï¿½ï¿½Ã£ï¿½Â¸Ã£ï¿½Â§Ã£ï¿½Â¯Ã£ï¿½ï¿½ w Ã£ï¿½Â®Ã§ï¿½ï¿½Ã¦ï¿½ï¿½
  background(120,120,120);
}


/////
void draw(){         //Ã£ï¿½ï¿½Ã£ï¿½Â¡Ã£ï¿½Â¤Ã£ï¿½Â³Ã©ï¿½Â¢Ã¦ï¿½Â°Ã£ï¿½ï¿½Ã¯Â¼ï¿½Ã§ï¿½Â¡Ã©ï¿½ï¿½Ã£ï¿½Â«Ã£ï¿½Â¼Ã£ï¿½ï¿½Ã¯Â¼ï¿½
  w.step();          //Ã£ï¿½ÂªÃ£ï¿½ï¿½Ã£ï¿½Â¸Ã£ï¿½Â§Ã£ï¿½Â¯Ã£ï¿½ï¿½ w Ã£ï¿½Â«Ã¦Â­Â©Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½
    w.mdisplay();
  w.display();       //Ã£ï¿½ÂªÃ£ï¿½ï¿½Ã£ï¿½Â¸Ã£ï¿½Â§Ã£ï¿½Â¯Ã£ï¿½ï¿½ w Ã£ï¿½Â«Ã¨ï¿½ÂªÃ¥ï¿½ï¿½Ã£ï¿½ï¿½Ã¨Â¡Â¨Ã§Â¤ÂºÃ£ï¿½ï¿½Ã£ï¿½Â¦Ã£ï¿½ï¿½Ã£ï¿½ï¿½Ã£ï¿½ï¿½

}
/////
