
int eSize = 10;//円の直径
int a = 40;//aの直径
size(600, 300);//ウィンドウのサイズ（600, 300）
background(255);//背景色(0~255)
smooth();//オブジェクトにアンチエイリアスをかける
noStroke();//線を描かない

for (int y = 0; y <= 300; y += 2) { //右
  for (int x = 300; x <= 600; x += 14) {//x方向に14ずつ
    fill(240+y, 155, 40+y);//描画色
    ellipse(x, y, eSize, eSize);//丸
  }
}

fill(20, 20, 190, 180);//青
ellipse(470, 270, 13, 13);//丸
ellipse(430, 230, 15, 15);//丸
fill(240, 10, 150, 200);//ピンク
ellipse(560, 130, 30, 30);//丸
ellipse(390, 200, 9, 9);//丸
fill(120, 60, 250, 220);//紫
ellipse(520, 220, 18, 18);//丸
ellipse(395, 270, 20, 20);//丸
fill(40, 200, 230, 200);//水色
ellipse(560, 275, 18, 18);//丸
ellipse(340, 200, 30, 30);//丸
fill(255, 195, 23, 200);//オレンジ
ellipse(470, 160, 22, 22);//丸
ellipse(340, 130, 12, 12);//丸
fill(155, 250, 90, 200);//緑
ellipse(490, 50, 22, 22);//丸
ellipse(320, 260, 15, 15);//丸

for (int x = 0; x <= width; x += 20) {//x方向に20ずつ
  fill(0, 140, 10);
}
strokeWeight(1);//線の太さ（1ピクセル）
for (int x= 10; x <=300; x+=40) {//x方向に40ずつ
  stroke(335, 250, x, 300+x);
  noFill();//中を描画しない
  ellipse(540, -20, x, x);//円
}
strokeWeight(2);//線の太さ（2ピクセル)
fill(200, 8, 98, 30);//中の描画色
ellipse(270, 290, 370, 520);//円
fill(133, 230, 5, 50);//中の描画色
ellipse(550, 550, 400, 700);//円

for (int y=0; y<300; y+=5) {//左 //y方向に5ずつ
  for (int x=0; x<300; x+=5) {//x方向に5ずつ
    fill(x, 157, 250);
    rect(x, y, 5, 5);//四角形
  }
}

for (int y = 5; y < 300; y += 50) {//y方向に50ずつ
  for (int x = 5; x < 300; x += 50) {//x方向に50ずつ
    fill(3-y, 157-y, 250-y);//色の指定
    rect(x, y, a, a);//四角形
  }
}
noStroke();//線を描かない
rectMode(CENTER);//基準点を図形の中心にする
for (int x= 0; x < 300; x+=50) {//y方向に5ずつ
  stroke(10, x, 250, 300+x);//線の描画色
  fill(180, 110, 255,40);//中の描画色
  rect(150, 150, x, x);//四角形
}



