
final int BACKGROUND_COLOR = 0xFF221100; // 背景色
Danbo danbo;                             // ダンボー
float time;                              // 経過時間の制御用変数


// ========================================
// 初期化
// ========================================
void setup() {
  size(400, 300, P3D);
  frameRate(30);
  
  noStroke();
  danbo = new Danbo(); 
}


// ========================================
// 描画
// ========================================
void draw() {
  // ----------------------------------------
  // ライトが常に正面から当たるように設定
  // ----------------------------------------
  camera(); lights();


  // ----------------------------------------
  // カウンタの更新
  // ----------------------------------------
  float angle = radians(time += .05);
  if(angle >= TWO_PI) angle = time = 0;
  
  
  // ----------------------------------------
  // カメラの設置
  // ----------------------------------------
  camera(700 * sin(angle), -600, -700 * cos(angle), 
         0,                -300,  0, 
         0,                 1,    0);
  
  background(BACKGROUND_COLOR);
  
  
  // ----------------------------------------
  // 歩行モーションの更新
  // ----------------------------------------
  danbo.update();
  
  
  // ----------------------------------------
  // リフレクション（おまけ）
  // ----------------------------------------
  pushMatrix();
  applyMatrix(1.0,  0.0, 0.0, 0.0,
              0.0, -1.0, 0.0, 0.0,
              0.0,  0.0, 1.0, 0.0,
              0.0,  0.0, 0.0, 1.0);
  danbo.render();

  camera();
  pushStyle();
  fill(0xDD << 24 | 0xFFFFFF & BACKGROUND_COLOR);
  rect(0, 0, width, height);
  popStyle();
  popMatrix();

  
  // ----------------------------------------
  // ダンボーの描画
  // ----------------------------------------
  danbo.render();
}

