
//Por algum motivo o site não está mostrando as configurações de cor do background, mas no programa roda.

colorMode (RGB, 10, 400, 500, 255);
size (800,400);
background (8,340,500,0);

fill (9, 250, 15, 200);
noStroke();
rect (0,280,800,150);

fill (10, 400, 500, 255);
stroke (0,0,0, 55);
rect (0, 265, 380, 30);

fill (0, 0, 0, 22);
noStroke ();
rect (0, 280, 380, 20);

fill (10, 400, 500, 255);
stroke (0, 0, 0, 50);
rect (85, 280, 10, 20);

fill (10, 400, 500, 255);
stroke (0, 0, 0, 50);
rect (280, 280, 10, 20);

fill (10, 400, 500, 255);
stroke (0,0,0,50);
rect (128, 280, 120, 5);

fill (10, 400, 500, 255);
stroke (0,0,0,50);
rect (127, 285, 122, 5);

fill (10, 400, 500, 255);
stroke (0,0,0,50);
rect (126, 290, 124, 5);

fill (10, 400, 500, 255);
stroke (0,0,0,50);
rect (125, 295, 126, 5);

fill (10, 400, 500, 255);
rect (55, 130, 700, 15);

rect (50, 130, 710, 5);

rect (55, 245, 700, 15);
fill (0, 0, 0, 10);
noStroke ();
rect (55, 245, 705, 15);

fill (10, 400, 500, 255);
stroke (0,0,0,30);
rect (87, 127, 8, 138);
rect (240, 135, 5, 111);

fill (10, 400, 500, 65);
stroke (0,0,0,45);
rect (245, 145, 510, 100);

fill (10, 400, 500, 255);
stroke (0,0,0,30);
rect (285, 127, 8, 138);
rect (380, 135, 5, 111);
rect (485, 127, 8, 165);
rect (685, 127, 8, 165);
rect (755, 135, 5, 125);

fill (10, 400, 500, 255);
stroke (0,0,0,50);
rect (130, 245, 110, 5);

fill (10, 400, 500, 255);
stroke (0,0,0,50);
rect (129, 250, 112, 5);

fill (10, 400, 500, 255);
stroke (0,0,0,50);
rect (128, 255, 114, 5);

fill (10, 400, 500, 255);
stroke (0,0,0,50);
rect (127, 260, 116, 5);
