
size(800, 800);
smooth();
background(0);
noStroke();//セットアップ
float s=2.5;//拡大縮小調整用変数

for (float x=0.0; x<=800; x++) {
  for (float y=0.0; y<=160; y++) {
    /*fill(255);
     ellipse(400+(-x+x*x*0.005+y*x*0.004-x*x*y*0.0000001),400-x,2,2);*/    //元となる形。

    fill(255, 0, 0, 4);
    ellipse(400+s*((-x+x*x*0.0035+y*x*0.004-x*x*y*0.0000002)*cos(90)-(-x)*sin(90)), 400+s*((-x+x*x*0.0035+y*x*0.004-x*x*y*0.0000002)*sin(90)+(-x)*cos(90)), 5, 5);
    fill(0, 255, 0, 4);
    ellipse(400+s*((-x+x*x*0.0035+y*x*0.004-x*x*y*0.0000002)*cos(180)-(-x)*sin(180)), 400+s*((-x+x*x*0.0035+y*x*0.004-x*x*y*0.0000002)*sin(180)+(-x)*cos(180)), 5, 5);
    fill(0, 0, 255, 4);
    ellipse(400+s*((-x+x*x*0.0035+y*x*0.004-x*x*y*0.0000002)*cos(270)-(-x)*sin(270)), 400+s*((-x+x*x*0.0035+y*x*0.004-x*x*y*0.0000002)*sin(270)+(-x)*cos(270)), 5, 5);
    //元となる形を中心で回転させ色を変える。なぜか90°で回転させたら三等分された。　謎。
  }
}

for (int z=0; z<=80; z++) {
  fill(255, 3);
  ellipse(400, 400, z*z*z/2500, z*z*z/2500);//中心の光。3次で広がっていくため、中心に集まるほど光が強くなる。
}



