

/*
背景グラデーションの上から　格子状のラインを引いてメーターを表現し
上から黒を塗ることで　メーターの出力を表現しました。
*/

int eSize = 1;
 
 
size(600,300);

smooth();
 
 /*背景グラデーション*/
for(int y =0; y<=300; y+=1){
for(int x=0; x<=600; x+=1){

  fill(x-100,y-50,450-x,255); 
  noStroke();  
  rect(x, y, eSize, eSize);

   }
}

/*網ライン*/

for(int x =0; x<=600; x+=20){
 stroke(0);
 strokeWeight(5);
 line(x,0,x,300);
 line(0,x,600,x);
  
}

/*メーター調整*/
noStroke();
fill(0);
rect(0, 0, 20, 240);  
rect(20, 0, 20, 220); 
rect(40, 0, 20, 220); 
rect(60, 0, 20, 200); 
rect(80, 0, 20, 220); 
rect(100, 0, 20, 255); 
rect(120, 0, 20, 240); 
rect(140, 0, 20, 250); 
rect(160, 0, 20, 270); 
rect(180, 0, 20, 220); 
rect(200, 0, 20, 240); 
rect(220, 0, 20, 210); 
rect(240, 0, 20, 200); 
rect(260, 0, 20, 190); 
rect(280, 0, 20, 220); 
rect(300, 0, 20, 230);
rect(320, 0, 20, 160);
rect(340, 0, 20, 100);
rect(360, 0, 20, 140);
rect(380, 0, 20, 25);
rect(400, 0, 20, 95);
rect(420, 0, 20, 45);
rect(440, 0, 20, 15);
rect(460, 0, 20, 60);
rect(480, 0, 20, 230);
rect(500, 0, 20, 140);
rect(520, 0, 20, 50);
rect(540, 0, 20, 92);
rect(560, 0, 20, 20);
rect(580, 0, 20, 5);

/*境界線*/
 stroke(20);
 strokeWeight(5);
 line(300,0,300,300);


