
int eSize = 35;

size(600,300);
background(255);

//背景となる色を四角を使って描く
rectMode(CENTER);
noStroke();
fill(134,200,223);
rect(75,75,150,150);
rect(225,225,150,150);
fill(255,180,200);
rect(225,75,150,150);
rect(75,225,150,150);

for(int x=0; x<400; x+=150){
  for(int y=0; y<400; y+=150){
    //赤い線を描く
 stroke(255,0,0);
    line(0,x,300,y);
    line(75,0,75,300);
    line(150,0,150,300);
    line(225,0,225,300);
    line(0,75,300,75);
    line(0,150,300,150);
    line(0,225,300,225);
    line(0,150,150,0);
    line(150,300,300,150);
    line(0,150,150,300);
    line(150,0,300,150);
}
}
 
//白い丸を描く
for(int x=0; x<400; x+=150){
  for(int y=0; y<600;  y+=150){
   
    fill(225);
    ellipse(x,y,eSize,eSize);
    ellipse(75,75,eSize,eSize);
    ellipse(75,225,eSize,eSize);
    ellipse(225,75,eSize,eSize);
    ellipse(225,225,eSize,eSize);
  }
  }
  
//背景となる色を四角を使って描く
rectMode(CENTER);
noStroke();
fill(0);
rect(330,150,60,300);
fill(60);
rect(397,150,65,300);
fill(120);
rect(455,150,70,300);
fill(150);
rect(500,150,75,300);

   
//三角を描く
stroke(255);
fill(100);
triangle(438,80,380,140,455,148);
fill(150);
triangle(460,200,463,230,500,226);
fill(50);
triangle(556,40,605,80,525,150);
triangle(350,230,380,235,330,350);


//円を描く
fill(255,150);
ellipse(450,190,90,90);
fill(250);
ellipse(375,225,20,20);
fill(200);
ellipse(370,75,50,50);
fill(100);
ellipse(580,250,30,30);
fill(230,230);
ellipse(580,30,40,40);

//様々な線を描いていく
stroke(255);
line(300,75,525,0);
line(300,40,525,150);
line(450,200,300,225);
line(300,130,350,133);
line(378,75,600,70);
line(300,150,525,230);
line(300,150,375,300);
line(300,240,450,225);

line(300,240,375,300);
line(375,300,450,180);
line(375,0,440,74);
line(338,180,525,30);
line(420,300,460,130);
line(300,225,450,0);
line(336,220,525,75);
line(338,0,420,130);
line(450,300,510,30);


