
void setup() {
size(800, 600);
background(0);
smooth();
}
   
void draw() {
  smooth();
if (keyPressed == true) {


}
 }

void mouseDragged()
{
stroke(random(50,100));
strokeWeight(0.50);
line (mouseY, 255, mouseX, 100);

//On va générer des lignes constantes
line (100,255,100,600);
line (120,255,120,600);
line (125,255,125,600);
line (140,255,140,600);
line (150,255,150,600);
line (155,255,155,600);
line (158,255,158,600);
line (170,255,170,600);
line (180,255,180,600);
line (183,255,183,600);
line (190,255,190,600);
line (210,255,210,600);
line (215,255,215,600);
line (218,255,218,600);
line (250,255,250,600);
line (260,255,260,600);
line (265,255,265,600);
line (270,255,270,600);
line (280,255,280,600);
line (283,255,283,600);
line (300,255,300,600);
line (350,255,350,600);
line (355,255,355,600);
line (360,255,360,600);
line (363,255,363,600);
line (370,255,370,600);
line (380,255,380,600);
line (383,255,383,600);
line (386,255,386,600);
line (400,255,400,600);

}


